Documents/КассоваяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КассоваяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>InformationRegister.ИсторияОтгрузок</xr:Item>
				<xr:Item>AccumulationRegister.Касса</xr:Item>
				<xr:Item>InformationRegister.Задолженности</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обороты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Уточнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Авансы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Сальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Сальдо</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаиморасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоСписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыВзаиморасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВзаиморасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОтгрузкаЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОтгрузкаЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>InformationRegister.ИсторияОтгрузок</xr:Item>
				<xr:Item>AccumulationRegister.Отгрузки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отгрузить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КассоваяОперация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыКонтрагентПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, ОбщийМодульСервер.ПолучитьЗначениеРеквизита(Объект.Касса, "ТипВзаиморасчета"), Объект.Дата);
КонецПроцедуры

&НаСервере
Процедура ОборотыЗаполнитьНаСервере()
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Для Каждого Строка Из Объект.Основание.Накладные Цикл
			Если Строка.Накладная.ВидРеализации.ТипВзаиморасчета = Перечисления.ТипыВзаиморасчета.Нал Тогда
				СтарыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Накладная", Строка.Накладная));
				Если СтарыеСтроки.Количество() > 0 Тогда
					ТекСтрока = СтарыеСтроки[0];
				Иначе
					ТекСтрока = Объект.Обороты.Добавить();
				КонецЕсли;
				
				ТекСтрока.Накладная = Строка.Накладная;
				ТекСтрока.Контрагент = Строка.Накладная.Контрагент;
				ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, Объект.Касса.ТипВзаиморасчета, Строка.Накладная.Дата + 1);
				ТекСтрока.Приход = Строка.Накладная.Сумма;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Сальдо.Контрагент КАК Контрагент,
			|	Сальдо.СуммаОстаток КАК Сумма
			|ИЗ
			|	РегистрНакопления.Сальдо.Остатки(&Дата, ТипВзаиморасчета = Значение(Перечисление.ТипыВзаиморасчета.Нал)) КАК Сальдо
			|ГДЕ
			|	Сальдо.Контрагент.Проект = &Проект
			|УПОРЯДОЧИТЬ ПО
			|	Сальдо.Контрагент.Наименование"
		);

		Запрос.УстановитьПараметр("Дата", Момент);
		Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаКонтрагент.Следующий() Цикл
			СтарыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Контрагент", ВыборкаКонтрагент.Контрагент));
			Если СтарыеСтроки.Количество() > 0 Тогда
				ТекСтрока = СтарыеСтроки[0];
			Иначе
				ТекСтрока = Объект.Обороты.Добавить();
			КонецЕсли;
			
			ТекСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
			ТекСтрока.Сальдо = ВыборкаКонтрагент.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Объект.Обороты.Сортировать("Контрагент");
	
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыЗаполнить(Кнопка)
	ОборотыЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОборотыОбновитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Сальдо.Контрагент КАК Контрагент,
	|	Сальдо.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Сальдо.Остатки(&Дата, Контрагент В (&СписокКонтрагентов) И ТипВзаиморасчета = Значение(Перечисление.ТипыВзаиморасчета.Нал)) КАК Сальдо
	|ГДЕ
	|	ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	Сальдо.Контрагент.Наименование");

	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("СписокКонтрагентов", Объект.Обороты.Выгрузить().ВыгрузитьКолонку("Контрагент"));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтарыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Контрагент", ВыборкаКонтрагент.Контрагент));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Обороты.Добавить();
		КонецЕсли;
		
		ТекСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
		ТекСтрока.Сальдо = ВыборкаКонтрагент.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОборотыОбновить(Кнопка)
	ОборотыОбновитьНаСервере();
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Приход,Расход", 0, 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Обороты.Удалить(Строка); 
	КонецЦикла;
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ЗначениеЗаполнено(Объект.Касса) = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПослеУдаления(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПриАктивизацииСтроки(Элемент)
	Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ДоходыПослеУдаления(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если ЗначениеЗаполнено(Объект.Касса) = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АвансыПослеУдаления(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура АвансыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура АвансыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		Если ЗначениеЗаполнено(Объект.Касса) = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ВыбранноеЗначение <> Объект.Основание Тогда
		Объект.Основание = ВыбранноеЗначение;
		
		ОборотыЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СписокОтгрузок = ПолучитьСписокОтгрузок();
	
	ДанныеВыбора = СписокОтгрузок;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОтгрузок()
	СписокОтгрузок = Новый СписокЗначений;
	
	//Выборка = Документы.ОтгрузкаЗаказов.Выбрать(,, Новый Структура("Статус", Перечисления.СтатусыОтгрузки.Отгружен);
	//Пока Выборка.Следующий() Цикл
	//	СписокОтгрузок.Добавить(Выборка.Ссылка);
	//КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОтгрузкаЗаказов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтгрузкаЗаказов КАК ОтгрузкаЗаказов
		|ГДЕ
		|	ОтгрузкаЗаказов.Статус = &Статус
		|	" + ?(ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Организация), "И ОтгрузкаЗаказов.Организация = &Организация", ""));
	
	Запрос.УстановитьПараметр("Организация", ПараметрыСеанса.Пользователь.Организация);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОтгрузки.Отгружен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОтгрузок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокОтгрузок;
КонецФункции

&НаСервере
Процедура Обновить()
	ОстатокДо = РаботаСКассой.Остаток(Объект.Касса, Объект.Дата);
	СуммаПрихода = Объект.Обороты.Итог("Приход") + Объект.Доходы.Итог("Приход");
	СуммаРасхода = Объект.Обороты.Итог("Расход") + Объект.Доходы.Итог("Расход");
	ОстатокПосле = ОстатокДо + СуммаПрихода - СуммаРасхода;
	
	СуммаВыделений = 0;
	МассивВыделенныхСтрок = Элементы.Обороты.ВыделенныеСтроки;
	
	Для Каждого СтрокаМассива Из МассивВыделенныхСтрок Цикл
	    СтрокаТаблицы = Объект.Обороты.НайтиПоИдентификатору(СтрокаМассива);
	    СуммаВыделений = СуммаВыделений + СтрокаТаблицы.Приход - СтрокаТаблицы.Расход;
	КонецЦикла;
КонецПроцедуры
